grpc_balancer.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-01-11 Wed 16:39 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>GRPC golang版源码分析之客户端(二)</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="./css/org-css.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="index.html"> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content">
<h1 class="title">GRPC golang版源码分析之客户端(二)</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org34b9f3c">1. 前言</a></li>
<li><a href="#org4296133">2. 负载均衡</a></li>
<li><a href="#orgb0a8079">3. 相关链接</a></li>
</ul>
</div>
</div>

<div id="outline-container-org34b9f3c" class="outline-2">
<h2 id="org34b9f3c"><span class="section-number-2">1</span> 前言</h2>
<div class="outline-text-2" id="text-1">
<p>
前面一篇文章分析了一个grpc call的大致调用流程，顺着源码走了一遍，但是grpc中有一些特性并没有进行分析，这篇blog主要就是分析负载均衡这个特性。负载均衡可以让你在使用grpc调用方法是连接不同的服务器。在启动的时候，grpc client会建立对所有服务器的连接，然后通过轮询算法拿不同的服务器。
</p>
</div>
</div>
<div id="outline-container-org4296133" class="outline-2">
<h2 id="org4296133"><span class="section-number-2">2</span> 负载均衡</h2>
<div class="outline-text-2" id="text-2">
<p>
负载均衡是在客户端实现的，通过在初始化一个grpc客户端传入一个负载均衡器，默认是通过轮询算法每次调用时切换调用的服务器，由于是在客户端做的，所以只能让服务器平摊压力，并不能实时的根据服务器的状态来进行负载均衡。比如某一刻所有的grpc客户端都轮到了同一个服务器（这里只是举例）。
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #74af68;">//</span><span style="color: #74af68;">&#22312;clientconn.go&#30340;DialContext&#20989;&#25968;&#20013;</span>
<span style="color: #ffad29; font-weight: bold;">go</span> <span style="color: #ffad29; font-weight: bold;">func</span><span style="color: #8c8c8c;">()</span> <span style="color: #8c8c8c;">{</span>
  <span style="color: #ffad29; font-weight: bold;">var</span> addrs <span style="color: #93a8c6;">[]</span><span style="color: #34cae2;">Address</span>
  <span style="color: #ffad29; font-weight: bold;">if</span> cc.dopts.balancer == <span style="color: #008b8b;">nil</span> <span style="color: #93a8c6;">{</span>
    <span style="color: #74af68;">// </span><span style="color: #74af68;">Connect to target directly if balancer is nil.</span>
    <span style="color: #74af68;">//</span><span style="color: #74af68;">&#22914;&#26524;&#27809;&#26377;&#35774;&#32622;&#36127;&#36733;&#22343;&#34913;&#22120;&#65292;&#21017;&#30452;&#25509;&#36830;&#25509;</span>
    addrs = <span style="color: #23d7d7;">append</span><span style="color: #b0b1a3;">(</span>addrs, <span style="color: #34cae2;">Address</span><span style="color: #97b098;">{</span>Addr: target<span style="color: #97b098;">}</span><span style="color: #b0b1a3;">)</span>
  <span style="color: #93a8c6;">}</span> <span style="color: #ffad29; font-weight: bold;">else</span> <span style="color: #93a8c6;">{</span>
    <span style="color: #ffad29; font-weight: bold;">var</span> credsClone credentials.TransportCredentials
    <span style="color: #ffad29; font-weight: bold;">if</span> creds != <span style="color: #008b8b;">nil</span> <span style="color: #b0b1a3;">{</span>
      credsClone = creds.<span style="color: #00ede1; font-weight: bold;">Clone</span><span style="color: #97b098;">()</span>
    <span style="color: #b0b1a3;">}</span>
    config := <span style="color: #34cae2;">BalancerConfig</span><span style="color: #b0b1a3;">{</span>
      <span style="color: #008b8b;">DialCreds</span>: credsClone,
    <span style="color: #b0b1a3;">}</span>
    <span style="color: #74af68;">//</span><span style="color: #74af68;">&#21551;&#21160;&#19968;&#20010;&#36127;&#36733;&#22343;&#34913;&#22120;,start&#20989;&#25968;&#20250;&#21551;&#21160;&#19968;&#20010;watch&#30417;&#21548;&#22320;&#22336;&#30340;&#21464;&#21270;&#65292;&#32780;Notify&#36820;&#22238;&#19968;&#20010;&#36890;&#36947;&#65292;&#22312;&#27599;&#27425;&#26381;&#21153;&#22120;&#22320;&#22336;&#21464;&#21270;&#21518;&#30340;&#26368;&#26032;&#22320;&#22336;&#20449;&#24687;.</span>
    <span style="color: #ffad29; font-weight: bold;">if</span> err := cc.dopts.balancer.<span style="color: #00ede1; font-weight: bold;">Start</span><span style="color: #b0b1a3;">(</span>target, config<span style="color: #b0b1a3;">)</span>; err != <span style="color: #008b8b;">nil</span> <span style="color: #b0b1a3;">{</span>
      waitC &lt;- err
      <span style="color: #ffad29; font-weight: bold;">return</span>
    <span style="color: #b0b1a3;">}</span>
    ch := cc.dopts.balancer.<span style="color: #00ede1; font-weight: bold;">Notify</span><span style="color: #b0b1a3;">()</span>
    <span style="color: #ffad29; font-weight: bold;">if</span> ch == <span style="color: #008b8b;">nil</span> <span style="color: #b0b1a3;">{</span>
      <span style="color: #74af68;">// </span><span style="color: #74af68;">There is no name resolver installed.</span>
      addrs = <span style="color: #23d7d7;">append</span><span style="color: #97b098;">(</span>addrs, <span style="color: #34cae2;">Address</span><span style="color: #aebed8;">{</span>Addr: target<span style="color: #aebed8;">}</span><span style="color: #97b098;">)</span>
    <span style="color: #b0b1a3;">}</span> <span style="color: #ffad29; font-weight: bold;">else</span> <span style="color: #b0b1a3;">{</span>
      addrs, ok = &lt;-ch
      <span style="color: #ffad29; font-weight: bold;">if</span> !ok || <span style="color: #23d7d7;">len</span><span style="color: #97b098;">(</span>addrs<span style="color: #97b098;">)</span> == <span style="color: #008b8b;">0</span> <span style="color: #97b098;">{</span>
        waitC &lt;- errNoAddr
        <span style="color: #ffad29; font-weight: bold;">return</span>
      <span style="color: #97b098;">}</span>
    <span style="color: #b0b1a3;">}</span>
  <span style="color: #93a8c6;">}</span>
  <span style="color: #74af68;">//</span><span style="color: #74af68;">&#23545;&#27599;&#19968;&#20010;&#22320;&#22336;&#36827;&#34892;&#36830;&#25509;, &#22240;&#20026;&#36825;&#26159;&#23458;&#25143;&#31471;&#21551;&#21160;&#26102;&#65292;&#25152;&#20197;&#38656;&#35201;&#23545;&#25152;&#26377;&#22320;&#22336;&#25805;&#20316;.</span>
  <span style="color: #ffad29; font-weight: bold;">for</span> _, a := <span style="color: #ffad29; font-weight: bold;">range</span> addrs <span style="color: #93a8c6;">{</span>
    <span style="color: #ffad29; font-weight: bold;">if</span> err := cc.<span style="color: #00ede1; font-weight: bold;">resetAddrConn</span><span style="color: #b0b1a3;">(</span>a, <span style="color: #008b8b;">false</span>, <span style="color: #008b8b;">nil</span><span style="color: #b0b1a3;">)</span>; err != <span style="color: #008b8b;">nil</span> <span style="color: #b0b1a3;">{</span>
      waitC &lt;- err
      <span style="color: #ffad29; font-weight: bold;">return</span>
    <span style="color: #b0b1a3;">}</span>
  <span style="color: #93a8c6;">}</span>
  <span style="color: #23d7d7;">close</span><span style="color: #93a8c6;">(</span>waitC<span style="color: #93a8c6;">)</span>
<span style="color: #8c8c8c;">}()</span>
..............
<span style="color: #74af68;">//</span><span style="color: #74af68;">&#30465;&#30053;&#19968;&#20123;&#20195;&#30721;</span>
<span style="color: #ffad29; font-weight: bold;">if</span> ok <span style="color: #8c8c8c;">{</span>
  <span style="color: #74af68;">//</span><span style="color: #74af68;">&#36825;&#37324;&#24320;&#21551;&#19968;&#20010;&#30417;&#21548;goroutine&#65292;&#20027;&#35201;&#26159;&#30417;&#21548;&#26381;&#21153;&#22120;&#22320;&#22336;&#21464;&#21270;&#24182;&#23545;&#26032;&#30340;&#22320;&#22336;&#24314;&#31435;&#36830;&#25509;&#65292;&#23545;&#32769;&#30340;&#22320;&#22336;&#20851;&#38381;&#36830;&#25509;</span>
  <span style="color: #ffad29; font-weight: bold;">go</span> cc.<span style="color: #00ede1; font-weight: bold;">lbWatcher</span><span style="color: #93a8c6;">()</span>
<span style="color: #8c8c8c;">}</span>
</pre>
</div>
<p>
上面的代码大致是说明了一个负载均衡器是怎么使用的，下面看看负载均衡具体的结构:
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #ffad29; font-weight: bold;">type</span> <span style="color: #34cae2;">Balancer</span> <span style="color: #ffad29; font-weight: bold;">interface</span> <span style="color: #8c8c8c;">{</span>
  <span style="color: #74af68;">//</span><span style="color: #74af68;">&#21551;&#21160;&#19968;&#20010;&#36127;&#36733;&#22343;&#34913;&#65292;&#20869;&#37096;&#20250;&#21551;&#21160;&#19968;&#20010;&#21517;&#31216;&#26381;&#21153;&#22120;&#30340;watcher&#65292;&#19981;&#26029;&#30417;&#21548;&#22320;&#22336;&#30340;&#21464;&#21270;</span>
  <span style="color: #00ede1; font-weight: bold;">Start</span><span style="color: #93a8c6;">(</span>target string, config BalancerConfig<span style="color: #93a8c6;">)</span> error
  <span style="color: #00ede1; font-weight: bold;">Up</span><span style="color: #93a8c6;">(</span>addr Address<span style="color: #93a8c6;">)</span> <span style="color: #93a8c6;">(</span>down <span style="color: #ffad29; font-weight: bold;">func</span><span style="color: #b0b1a3;">(</span><span style="color: #34cae2;">error</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
  <span style="color: #74af68;">//</span><span style="color: #74af68;">&#24471;&#21040;&#19979;&#19968;&#27425;&#36830;&#25509;&#30340;&#22320;&#22336;</span>
  <span style="color: #00ede1; font-weight: bold;">Get</span><span style="color: #93a8c6;">(</span>ctx context.Context, opts BalancerGetOptions<span style="color: #93a8c6;">)</span> <span style="color: #93a8c6;">(</span>addr Address, put <span style="color: #ffad29; font-weight: bold;">func</span><span style="color: #b0b1a3;">()</span>, err error<span style="color: #93a8c6;">)</span>
  <span style="color: #74af68;">//</span><span style="color: #74af68;">&#20174;&#26381;&#21153;&#22120;&#24471;&#21040;&#26356;&#26032;&#30340;&#22320;&#22336;,&#36825;&#20010;&#22320;&#22336;&#26159;&#26356;&#26032;&#21518;&#30340;&#25152;&#26377;&#22320;&#22336;</span>
  <span style="color: #00ede1; font-weight: bold;">Notify</span><span style="color: #93a8c6;">()</span> &lt;-<span style="color: #ffad29; font-weight: bold;">chan</span> <span style="color: #93a8c6;">[]</span><span style="color: #34cae2;">Address</span>
  <span style="color: #74af68;">//</span><span style="color: #74af68;">&#20851;&#38381;&#36127;&#36733;&#22343;&#34913;&#22120;</span>
  <span style="color: #00ede1; font-weight: bold;">Close</span><span style="color: #93a8c6;">()</span> error
<span style="color: #8c8c8c;">}</span>
</pre>
</div>
<p>
负载均衡器有个默认实现在balancer.go中，使用的轮询算法。这个实现中包含了一个名字服务器的服务，我们可以通过实现一个名字服务器的接口，然后封装到这个负载均衡器中，这样就不需要自己实现整个负载均衡器。名字服务器的接口如下:
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #ffad29; font-weight: bold;">type</span> <span style="color: #34cae2;">Update</span> <span style="color: #ffad29; font-weight: bold;">struct</span> <span style="color: #8c8c8c;">{</span>
  <span style="color: #74af68;">// </span><span style="color: #74af68;">Op indicates the operation of the update.</span>
  Op Operation
  <span style="color: #74af68;">// </span><span style="color: #74af68;">Addr is the updated address. It is empty string if there is no address update.</span>
  Addr string
  <span style="color: #74af68;">// </span><span style="color: #74af68;">Metadata is the updated metadata. It is nil if there is no metadata update.</span>
  <span style="color: #74af68;">// </span><span style="color: #74af68;">Metadata is not required for a custom naming implementation.</span>
  Metadata <span style="color: #ffad29; font-weight: bold;">interface</span><span style="color: #93a8c6;">{}</span>
<span style="color: #8c8c8c;">}</span>
<span style="color: #74af68;">// </span><span style="color: #74af68;">Resolver creates a Watcher for a target to track its resolution changes.</span>
<span style="color: #ffad29; font-weight: bold;">type</span> <span style="color: #34cae2;">Resolver</span> <span style="color: #ffad29; font-weight: bold;">interface</span> <span style="color: #8c8c8c;">{</span>
  <span style="color: #74af68;">// </span><span style="color: #74af68;">Resolve creates a Watcher for target.</span>
  <span style="color: #74af68;">//</span><span style="color: #74af68;">&#36890;&#36807;&#19968;&#20010;&#21517;&#23383;&#24471;&#21040;&#19968;&#20010;watcher&#65292;&#30417;&#21548;&#26381;&#21153;&#22120;&#22320;&#22336;&#21464;&#21270;&#12290;</span>
  <span style="color: #00ede1; font-weight: bold;">Resolve</span><span style="color: #93a8c6;">(</span>target string<span style="color: #93a8c6;">)</span> <span style="color: #93a8c6;">(</span>Watcher, error<span style="color: #93a8c6;">)</span>
<span style="color: #8c8c8c;">}</span>
<span style="color: #74af68;">// </span><span style="color: #74af68;">Watcher watches for the updates on the specified target.</span>
<span style="color: #ffad29; font-weight: bold;">type</span> <span style="color: #34cae2;">Watcher</span> <span style="color: #ffad29; font-weight: bold;">interface</span> <span style="color: #8c8c8c;">{</span>
  <span style="color: #74af68;">// </span><span style="color: #74af68;">Next blocks until an update or error happens. It may return one or more</span>
  <span style="color: #74af68;">// </span><span style="color: #74af68;">updates. The first call should get the full set of the results. It should</span>
  <span style="color: #74af68;">// </span><span style="color: #74af68;">return an error if and only if Watcher cannot recover.</span>
  <span style="color: #74af68;">// </span><span style="color: #74af68;">&#24471;&#21040;&#19979;&#27425;&#26356;&#26032;&#30340;&#22320;&#22336;</span>
  <span style="color: #00ede1; font-weight: bold;">Next</span><span style="color: #93a8c6;">()</span> <span style="color: #93a8c6;">(</span><span style="color: #b0b1a3;">[]</span>*<span style="color: #34cae2;">Update</span>, error<span style="color: #93a8c6;">)</span>
  <span style="color: #74af68;">// </span><span style="color: #74af68;">Close closes the Watcher.</span>
  <span style="color: #00ede1; font-weight: bold;">Close</span><span style="color: #93a8c6;">()</span>
<span style="color: #8c8c8c;">}</span>
</pre>
</div>
<p>
负载均衡器的全貌大概就这些了，其中还有些细节我没有看到，目前来说我也不希望过早深入这些细节。所以负载均衡就到这里啦。
</p>
</div>
</div>

<div id="outline-container-orgb0a8079" class="outline-2">
<h2 id="orgb0a8079"><span class="section-number-2">3</span> 相关链接</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li><a href="http://www.grpc.io/docs/guides/auth.html#overview">http://www.grpc.io/docs/guides/auth.html#overview</a> 验证文档</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2017-01-11 Wed 16:39</p>
<p class="validation"></p>
</div>
</body>
</html>
